W8D1/RedditClone/app/controllers/subs_controller.rb

    def update
        @sub = Sub.find(params[:id])
        if @sub
            @sub.update_attributes(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Edited sub"], ["description", "Edited"], ["updated_at", "2020-03-30 23:27:54.745058"], ["id", 1]]

    def require_moderator
        sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]