W8D1/RedditClone/app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "vl8Ub6N_ePlR-bNe8RuNDw"], ["updated_at", "2020-03-30 17:39:35.682853"], ["id", 5]]