W7D1/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find_by(id: params[:id])